## Pruebas con la librerÃ­a pandas

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### Objetos Series

In [9]:
import string
from random import randint

In [4]:
s1 = Series([1,2,3,4], index=list('abcd'))
s2 = Series(np.arange(15))

In [5]:
s1

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
s1['a'], s1[0]

(1, 1)

In [7]:
s1[-1]

4

In [11]:
letras = string.ascii_uppercase
L = [randint(1,50) for i in range(len(letras))]
s = Series(L, index=list(letras))
s[:10]

A    25
B     7
C    19
D    50
E    33
F    45
G    33
H    20
I    16
J    18
dtype: int64

In [13]:
(s > 20)[:10]

A     True
B    False
C    False
D     True
E     True
F     True
G     True
H    False
I    False
J    False
dtype: bool

In [14]:
s[(s >= 20) & (s <= 30)]

A    25
H    20
X    30
Z    24
dtype: int64

In [15]:
s[['A','B','D']]

A    25
B     7
D    50
dtype: int64

In [16]:
np.mean(s)

26.5

In [17]:
s[(s >= 20) & (s <= 30)].sum()

99

In [18]:
((s >= 20) & (s <= 30)).sum()

4

In [20]:
s1 = Series(list(range(5)), index=list('abcde'))
s2 = Series(list(range(5)), index=list('aeiou'))
resul = s1 + s2
resul

a    0.0
b    NaN
c    NaN
d    NaN
e    5.0
i    NaN
o    NaN
u    NaN
dtype: float64

In [21]:
resul.isnull()

a    False
b     True
c     True
d     True
e    False
i     True
o     True
u     True
dtype: bool

In [23]:
resul2 = s1.add(s2, fill_value=0)
resul2

a    0.0
b    1.0
c    2.0
d    3.0
e    5.0
i    2.0
o    3.0
u    4.0
dtype: float64

In [24]:
resul2 + 10

a    10.0
b    11.0
c    12.0
d    13.0
e    15.0
i    12.0
o    13.0
u    14.0
dtype: float64

###  DataFrame

In [25]:
df = DataFrame(np.arange(30).reshape(6,5))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29

In [26]:
df.columns = list('abcde')
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29

In [27]:
df['b']

0     1
1     6
2    11
3    16
4    21
5    26
Name: b, dtype: int32

In [28]:
df.loc[3]

a    15
b    16
c    17
d    18
e    19
Name: 3, dtype: int32

In [29]:
df['e'][5], df.loc[5]['e']

(29, 29)

In [30]:
d = {letra:[randint(1,10) for _ in range(6)] for letra in "abcde"}
df2 = DataFrame(d)
df2

    a  b   c  d   e
0   7  6   5  7   9
1   2  6  10  3  10
2   6  6   8  9   2
3   6  5   2  8  10
4  10  7   8  7  10
5   7  6   1  2   8

In [31]:
df3 = DataFrame(df2)
df3

    a  b   c  d   e
0   7  6   5  7   9
1   2  6  10  3  10
2   6  6   8  9   2
3   6  5   2  8  10
4  10  7   8  7  10
5   7  6   1  2   8